# Import library

In [1]:
import pandas as pd

# Load dataset

In [2]:
df = pd.read_csv("TokoBuku_Bersih.csv")
df

,id_transaksi,jenis_item,jumlah,tanggal pembelian,nama_customer,total
0,133889.0,Alat Tulis,1,1/1/2010,Stacy Campos,120000.0
1,133889.0,Buku Sejarah,1,1/1/2010,Stacy Campos,150000.0
2,133889.0,Buku Anak-Anak,2,1/1/2010,Stacy Campos,400000.0
3,133889.0,Majalah Fashion,1,1/1/2010,Stacy Campos,130000.0
4,133889.0,Majalah Berita,2,1/1/2010,Stacy Campos,600000.0
...,...,...,...,...,...,...
2459,134294.0,Alat Tulis,3,4/30/2024,Richard Jones,180000.0
2460,134294.0,Buku Sejarah,4,4/30/2024,Richard Jones,2400000.0
2461,134294.0,Buku Anak-Anak,2,4/30/2024,Richard Jones,80000.0
2462,134294.0,Majalah Fashion,9,4/30/2024,Richard Jones,1620000.0
2463,134294.0,Majalah Berita,4,4/30/2024,Richard Jones,320000.0

# Memeriksa nilai yang hilang

In [3]:
# Mengecek apakah ada data yang mengandung nilai kosong (NaN) di dalam DataFrame
if df.isna().values.any():
    print("\nTerdapat data Missing Values.")
    
    # Menampilkan jumlah missing values per kolom
    print("\nJumlah Missing Values per Kolom:")
    print(df.isna().sum())

    # Menampilkan baris-baris yang mengandung missing values
    print("\nBaris yang mengandung Missing Vales:")
    print(df[df.isna().any(axis=1)])
else:
    print("\nTidak ada data Missing Values.")

Tidak ada data Missing Values.

#